sample-results-gemfire-colocated-3vm/output_gemfire_homelab_colocated_3vm_10000_20t_run.txt
/var/vcap/packages/jdk/bin/java  -classpath /root/workspace/YCSB-geode-custom/conf:/root/workspace/YCSB-geode-custom/core/target/core-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/geode-binding-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/LatencyUtils-2.0.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/antlr-2.7.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/awaitility-4.2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/bson-4.8.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/classgraph-4.8.154.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-beanutils-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-codec-1.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-collections-3.2.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-digester-2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-io-2.11.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-lang3-3.12.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-logging-1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-validator-1.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/fastutil-8.5.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-common-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-core-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-deployment-chained-classloader-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-logging-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-management-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-membership-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-serialization-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-messenger-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-server-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-unsafe-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-version-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/hamcrest-2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpclient-4.5.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpcore-4.4.16.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/istack-commons-runtime-4.0.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-annotations-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-core-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-databind-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-joda-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-jsr310-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.activation-api-1.2.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.resource-api-1.7.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.transaction-api-1.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-api-2.3.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-impl-2.3.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jgroups-3.6.14.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-platform-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/joda-time-2.10.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jopt-simple-5.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/log4j-api-2.19.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-commons-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-core-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-observation-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-buffer-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-codec-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-handler-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-resolver-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/rmiio-2.1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-cache-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-ogdl-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-cipher-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-hash-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-event-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-lang-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/slf4j-api-1.7.25.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-beans-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-core-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-jcl-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-web-5.3.34.jar site.ycsb.Client -t -db site.ycsb.db.GeodeClient -P ../workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
Command line: -t -db site.ycsb.db.GeodeClient -P ../workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
[INFO] core.Client recordcount:10000
[INFO] core.Client threadcount:120
[INFO] core.Client operationcount:10000
[INFO] core.Client readproportion:0.5
[INFO] core.Client updateproportion:0.5
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-04-22 13:03:07:869 0 sec: 0 operations; est completion in 0 second 
ERROR StatusLogger Log4j2 could not find a logging implementation. Please add log4j-core to the classpath. Using SimpleLogger to log to the console...
[INFO] geode.Creating Cache
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
[INFO] geode.Created Cache: geode-client
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[INFO] core.ClientThread initialized: threadid: 102
[INFO] core.ClientThread initialized: threadid: 108
[INFO] core.ClientThread initialized: threadid: 47
[INFO] core.ClientThread initialized: threadid: 79
[INFO] core.ClientThread initialized: threadid: 2
[INFO] core.ClientThread initialized: threadid: 68
[INFO] core.ClientThread initialized: threadid: 38
[INFO] core.ClientThread initialized: threadid: 117
[INFO] core.ClientThread initialized: threadid: 90
[INFO] core.ClientThread initialized: threadid: 83
[INFO] core.ClientThread initialized: threadid: 50
[INFO] core.ClientThread initialized: threadid: 32
[INFO] core.ClientThread initialized: threadid: 6
[INFO] core.ClientThread initialized: threadid: 22
[INFO] core.ClientThread initialized: threadid: 107
[INFO] core.ClientThread initialized: threadid: 95
[INFO] core.ClientThread initialized: threadid: 34
[INFO] core.ClientThread initialized: threadid: 44
[INFO] core.ClientThread initialized: threadid: 64
[INFO] core.ClientThread initialized: threadid: 55
[INFO] core.ClientThread initialized: threadid: 106
[INFO] core.ClientThread initialized: threadid: 1
[INFO] core.ClientThread initialized: threadid: 25
[INFO] core.ClientThread initialized: threadid: 104
[INFO] core.ClientThread initialized: threadid: 48
[INFO] core.ClientThread initialized: threadid: 84
[INFO] core.ClientThread initialized: threadid: 14
[INFO] core.ClientThread initialized: threadid: 37
[INFO] core.ClientThread initialized: threadid: 26
[INFO] core.ClientThread initialized: threadid: 75
[INFO] core.ClientThread initialized: threadid: 57
[INFO] core.ClientThread initialized: threadid: 36
[INFO] core.ClientThread initialized: threadid: 81
[INFO] core.ClientThread initialized: threadid: 65
[INFO] core.ClientThread initialized: threadid: 99
[INFO] core.ClientThread initialized: threadid: 12
[INFO] core.ClientThread initialized: threadid: 62
[INFO] core.ClientThread initialized: threadid: 82
[INFO] core.ClientThread initialized: threadid: 80
[INFO] core.ClientThread initialized: threadid: 74
[INFO] core.ClientThread initialized: threadid: 92
[INFO] core.ClientThread initialized: threadid: 67
[INFO] core.ClientThread initialized: threadid: 0
[INFO] core.ClientThread initialized: threadid: 43
[INFO] core.ClientThread initialized: threadid: 9
[INFO] core.ClientThread initialized: threadid: 51
[INFO] core.ClientThread initialized: threadid: 71
[INFO] core.ClientThread initialized: threadid: 115
[INFO] core.ClientThread initialized: threadid: 40
[INFO] core.ClientThread initialized: threadid: 94
[INFO] core.ClientThread initialized: threadid: 110
[INFO] core.ClientThread initialized: threadid: 29
[INFO] core.ClientThread initialized: threadid: 31
[INFO] core.ClientThread initialized: threadid: 10
[INFO] core.ClientThread initialized: threadid: 52
[INFO] core.ClientThread initialized: threadid: 91
[INFO] core.ClientThread initialized: threadid: 46
[INFO] core.ClientThread initialized: threadid: 101
[INFO] core.ClientThread initialized: threadid: 61
[INFO] core.ClientThread initialized: threadid: 20
[INFO] core.ClientThread initialized: threadid: 24
[INFO] core.ClientThread initialized: threadid: 100
[INFO] core.ClientThread initialized: threadid: 89
[INFO] core.ClientThread initialized: threadid: 63
[INFO] core.ClientThread initialized: threadid: 93
[INFO] core.ClientThread initialized: threadid: 19
[INFO] core.ClientThread initialized: threadid: 21
[INFO] core.ClientThread initialized: threadid: 86
[INFO] core.ClientThread initialized: threadid: 59
[INFO] core.ClientThread initialized: threadid: 30
[INFO] core.ClientThread initialized: threadid: 109
[INFO] core.ClientThread initialized: threadid: 53
[INFO] core.ClientThread initialized: threadid: 66
[INFO] core.ClientThread initialized: threadid: 76
[INFO] core.ClientThread initialized: threadid: 97
[INFO] core.ClientThread initialized: threadid: 118
[INFO] core.ClientThread initialized: threadid: 11
[INFO] core.ClientThread initialized: threadid: 23
[INFO] core.ClientThread initialized: threadid: 112
[INFO] core.ClientThread initialized: threadid: 69
[INFO] core.ClientThread initialized: threadid: 16
[INFO] core.ClientThread initialized: threadid: 85
[INFO] core.ClientThread initialized: threadid: 70
[INFO] core.ClientThread initialized: threadid: 119
[INFO] core.ClientThread initialized: threadid: 42
[INFO] core.ClientThread initialized: threadid: 87
[INFO] core.ClientThread initialized: threadid: 54
[INFO] core.ClientThread initialized: threadid: 35
[INFO] core.ClientThread initialized: threadid: 39
[INFO] core.ClientThread initialized: threadid: 72
[INFO] core.ClientThread initialized: threadid: 96
[INFO] core.ClientThread initialized: threadid: 33
[INFO] core.ClientThread initialized: threadid: 98
[INFO] core.ClientThread initialized: threadid: 103
[INFO] core.ClientThread initialized: threadid: 113
[INFO] core.ClientThread initialized: threadid: 88
[INFO] core.ClientThread initialized: threadid: 105
[INFO] core.ClientThread initialized: threadid: 73
[INFO] core.ClientThread initialized: threadid: 45
[INFO] core.ClientThread initialized: threadid: 111
[INFO] core.ClientThread initialized: threadid: 3
[INFO] core.ClientThread initialized: threadid: 28
[INFO] core.ClientThread initialized: threadid: 49
[INFO] core.ClientThread initialized: threadid: 56
[INFO] core.ClientThread initialized: threadid: 5
[INFO] core.ClientThread initialized: threadid: 27
[INFO] core.ClientThread initialized: threadid: 17
[INFO] core.ClientThread initialized: threadid: 58
[INFO] core.ClientThread initialized: threadid: 8
[INFO] core.ClientThread initialized: threadid: 41
[INFO] core.ClientThread initialized: threadid: 116
[INFO] core.ClientThread initialized: threadid: 13
[INFO] core.ClientThread initialized: threadid: 77
[INFO] core.ClientThread initialized: threadid: 4
[INFO] core.ClientThread initialized: threadid: 60
[INFO] core.ClientThread initialized: threadid: 78
[INFO] core.ClientThread initialized: threadid: 114
[INFO] core.ClientThread initialized: threadid: 18
[INFO] core.ClientThread initialized: threadid: 7
[INFO] core.ClientThread initialized: threadid: 15
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
2024-04-22 13:03:16:882 9 sec: 10000 operations; 1074.58 current ops/sec; [READ: Count=5041, Max=5595135, Min=239, Avg=80455.45, 90=29871, 99=2914303, 99.9=4968447, 99.99=5591039] [CLEANUP: Count=120, Max=1, Min=0, Avg=0.01, 90=0, 99=0, 99.9=1, 99.99=1] [UPDATE: Count=4959, Max=5611519, Min=278, Avg=75925.12, 90=35071, 99=2861055, 99.9=5337087, 99.99=5611519] 
[OVERALL], RunTime(ms), 9309
[OVERALL], Throughput(ops/sec), 1074.2292405199269
[TOTAL_GCS_G1_Young_Generation], Count, 12
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 128
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3750134278655064
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 128
[TOTAL_GC_TIME_%], Time(%), 1.3750134278655064
[READ], Operations, 5041
[READ], AverageLatency(us), 80455.44514977187
[READ], MinLatency(us), 239
[READ], MaxLatency(us), 5595135
[READ], 95thPercentileLatency(us), 67519
[READ], 99thPercentileLatency(us), 2914303
[READ], Return=OK, 5041
[CLEANUP], Operations, 120
[CLEANUP], AverageLatency(us), 0.008333333333333333
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 0
[CLEANUP], 99thPercentileLatency(us), 0
[UPDATE], Operations, 4959
[UPDATE], AverageLatency(us), 75925.12462189958
[UPDATE], MinLatency(us), 278
[UPDATE], MaxLatency(us), 5611519
[UPDATE], 95thPercentileLatency(us), 66559
[UPDATE], 99thPercentileLatency(us), 2861055
[UPDATE], Return=OK, 4959